In [12]:
import sqlite3
conn=sqlite3.connect('INDUSTRY')
print('OPENED DATABASE SUCCESSFULLY')

OPENED DATABASE SUCCESSFULLY

In [13]:
conn.execute('''CREATE TABLE INDUSTRY
           (ID INT PRIMARYN KEY,
           NAME Text,
           AGE Int,
           ADDRESS Char(50),
           salary real);''')
print('TABLE CREATED SUCCESSFULLY')

TABLE CREATED SUCCESSFULLY

In [14]:
conn.execute('''INSERT INTO INDUSTRY VALUES(1,'ABHI',19,'INDIA',200000)''');
conn.execute('''INSERT INTO INDUSTRY VALUES(2,'AAKASH',20,'USA',250000)''');
conn.execute('''INSERT INTO INDUSTRY VALUES(3,'ABINESH',21,'UK',300000)''');
conn.commit()
print('records created successfully')

records created successfully

In [15]:
cursor=conn.execute("SELECT* from INDUSTRY")
for row in cursor:
    print(row)

(1, 'ABHI', 19, 'INDIA', 200000.0)
(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [18]:
conn.execute("UPDATE INDUSTRY set salary=300000 where ID=3")
conn.commit()
print("total numberb of rows updated:",conn.total_changes)

total numberb of rows updated: 6

In [35]:
for row in cursor.execute("SELECT* FROM INDUSTRY ORDER BY AGE"):
    print(row)

(1, 'ABHI', 19, 'INDIA', 300000.0)
(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [34]:
for row in cursor.execute("SELECT DISTINCT NAME from INDUSTRY WHERE NAME LIKE 'A%'"):
    print(row)

('ABHI',)
('AAKASH',)
('ABINESH',)

In [37]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE IN (19,21)"):
                          print(row)

(1, 'ABHI', 19, 'INDIA', 300000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [38]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE NOT IN (19,21)"):
                          print(row)

(2, 'AAKASH', 20, 'USA', 250000.0)

In [43]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE BETWEEN 19 AND 21"):
                          print(row)

(1, 'ABHI', 19, 'INDIA', 300000.0)
(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [48]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE>19 AND AGE<21"):
                          print(row)

(2, 'AAKASH', 20, 'USA', 250000.0)

In [49]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE>19 or AGE<21"):
                          print(row)

(1, 'ABHI', 19, 'INDIA', 300000.0)
(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [51]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERE AGE!=19 "):
                          print(row)

(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)

In [52]:
for row in cursor.execute("SELECT* FROM INDUSTRY WHERe NAME GLOB'A*'"):
                          print(row)

(1, 'ABHI', 19, 'INDIA', 300000.0)
(2, 'AAKASH', 20, 'USA', 250000.0)
(3, 'ABINESH', 21, 'UK', 300000.0)